#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
ansible_host.aap_instance[1]: Refreshing state... [id=ec2-3-133-159-205.us-east-2.compute.amazonaws.com]
tls_private_key.cloud_key: Refreshing state... [id=50afe3012a325b1331bf7200ea61273b927e1db4]
ansible_host.aap_instance[0]: Refreshing state... [id=ec2-3-133-159-205.us-east-2.compute.amazonaws.com]
aws_key_pair.cloud_key: Refreshing state... [id=cloud_key]
data.aws_ami.ubuntu: Reading...
data.aws_ami.rhel: Reading...
aws_vpc.aap_vpc: Refreshing state... [id=vpc-02ea6923a2d07f148]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-07e7b4e1174e7d3ba]
data.aws_ami.rhel: Read complete after 1s [id=ami-0f7504305008843ad]
aws_internet_gateway.aap_igw: Refreshing state... [id=igw-05443bdbe2b9d3ccf]
aws_security_group.aap_security_group: Refreshing state... [id=sg-0b87801f0bfafeedd]
aws_subnet.aap_subnet: Refreshing state... [id=subnet-0eaebc6f3b51ea0cc]
aws_security_group.mqtt_sg: Refreshing state... [id=sg-0f9b926eb29746366]
aws_route_table.aap_pub_igw: Refreshing state... [id=rtb-087cf03e33f02d264]
aws_security_group_rule.mqtt_ingress_access: Refreshing state... [id=sgrule-244797405]
aws_security_group_rule.mqtt_egress_access: Refreshing state... [id=sgrule-1176853777]
aws_security_group_rule.postgresql_ingress_access: Refreshing state... [id=sgrule-2652299423]
aws_security_group_rule.ssh_ingress_access: Refreshing state... [id=sgrule-2551418711]
aws_security_group_rule.redis_ingress_access: Refreshing state... [id=sgrule-2668681585]
aws_security_group_rule.secure_ingress_access: Refreshing state... [id=sgrule-3527397830]
aws_security_group_rule.https_ingress_access: Refreshing state... [id=sgrule-2729864957]
aws_security_group_rule.grpc_ingress_access: Refreshing state... [id=sgrule-1992225328]
aws_security_group_rule.http_ingress_access: Refreshing state... [id=sgrule-781832930]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-2357181151]
aws_instance.mqtt_broker: Refreshing state... [id=i-022a07c9fea234fa0]
aws_instance.aap_instance: Refreshing state... [id=i-0265b38fa4b6a6cc5]
aws_route_table_association.aap_rt_subnet_public: Refreshing state... [id=rtbassoc-0d37d4f71df9b891a]
null_resource.mqtt_instance_setup: Refreshing state... [id=8981816890426697255]
null_resource.aap_instance_setup: Refreshing state... [id=4925893598333757313]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # ansible_host.aap_instance[0] will be destroyed
  # (because ansible_host.aap_instance is not in configuration)
  - resource "ansible_host" "aap_instance" {
      - groups    = [
          - "gateway",
        ] -> null
      - id        = "ec2-3-133-159-205.us-east-2.compute.amazonaws.com" -> null
      - name      = "ec2-3-133-159-205.us-east-2.compute.amazonaws.com" -> null
      - variables = {
          - "ansible_python_interpreter"   = "/usr/bin/python3"
          - "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          - "ansible_user"                 = "ec2-user"
        } -> null
    }

  # ansible_host.aap_instance[1] will be destroyed
  # (because ansible_host.aap_instance is not in configuration)
  - resource "ansible_host" "aap_instance" {
      - groups    = [
          - "gateway",
        ] -> null
      - id        = "ec2-3-133-159-205.us-east-2.compute.amazonaws.com" -> null
      - name      = "ec2-3-133-159-205.us-east-2.compute.amazonaws.com" -> null
      - variables = {
          - "ansible_python_interpreter"   = "/usr/bin/python3"
          - "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          - "ansible_user"                 = "ec2-user"
        } -> null
    }

  # ansible_host.mqtt_broker[0] will be created
  + resource "ansible_host" "mqtt_broker" {
      + groups    = [
          + "gateway",
        ]
      + id        = (known after apply)
      + name      = "ec2-3-144-30-94.us-east-2.compute.amazonaws.com"
      + variables = {
          + "ansible_python_interpreter"   = "/usr/bin/python3"
          + "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          + "ansible_user"                 = "ec2-user"
        }
    }

  # ansible_host.mqtt_broker[1] will be created
  + resource "ansible_host" "mqtt_broker" {
      + groups    = [
          + "gateway",
        ]
      + id        = (known after apply)
      + name      = "ec2-3-144-30-94.us-east-2.compute.amazonaws.com"
      + variables = {
          + "ansible_python_interpreter"   = "/usr/bin/python3"
          + "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          + "ansible_user"                 = "ec2-user"
        }
    }

  # aws_security_group_rule.mqtt_ssh_access will be created
  + resource "aws_security_group_rule" "mqtt_ssh_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0f9b926eb29746366"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # null_resource.mqtt_instance_setup is tainted, so must be replaced
-/+ resource "null_resource" "mqtt_instance_setup" {
      ~ id = "8981816890426697255" -> (known after apply)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*